JayHeng/imxrt-flexspi-mem-fw/devices/MIMXRT1189/drivers/fsl_ele_crypto.c
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>

#include "fsl_ele_crypto.h"
#include "fsl_s3mu.h"

/*******************************************************************************
 * Definitions
 *******************************************************************************/
#define RESPONSE_SUCCESS (0x0u)

#define LOAD_FW                  (0x17020406u)
#define LOAD_FW_SIZE             (0x4u)
#define LOAD_FW_RESPONSE_HDR     (0xe1020206u)
#define LOAD_FW_RESPONSE_SUCCESS (0x000000d6u)

#define OPEN_SESSION              (0x17100307u)
#define OPEN_SESSION_SIZE         (0x3u)
#define OPEN_SESSION_RESPONSE_HDR (0xe1100307u)

#define CLOSE_SESSION              (0x17110207u)
#define CLOSE_SESSION_SIZE         (0x2u)
#define CLOSE_SESSION_RESPONSE_HDR (0xe1110207u)

#define OPEN_HASH_SESSION              (0x17900607u)
#define OPEN_HASH_SESSION_SIZE         (0x6u)
#define OPEN_HASH_SESSION_RESPONSE_HDR (0xe1900307u)

#define CLOSE_HASH_SESSION              (0x17910207u)
#define CLOSE_HASH_SESSION_SIZE         (0x2u)
#define CLOSE_HASH_SESSION_RESPONSE_HDR (0xe1910207u)

#define HASH_ONE_GO              (0x17920807u)
#define HASH_ONE_GO_SIZE         (0x8u)
#define HASH_ONE_GO_RESPONSE_HDR (0xe1920207u)

#define OPEN_KEY_STORE              (0x17300607u)
#define OPEN_KEY_STORE_SIZE         (0x6u)
#define OPEN_KEY_STORE_RESPONSE_HDR (0xe1300307u)
#define MIN_MAC_LEN_SHIFT           (24u)
#define MIN_MAC_FLAG_SHIFT          (19u)
#define KEYSTORE_CREATE_SHIFT       (16u)

#define CLOSE_KEY_STORE              (0x17310307u)
#define CLOSE_KEY_STORE_SIZE         (0x3u)
#define CLOSE_KEY_STORE_RESPONSE_HDR (0xe1310207u)

#define KEY_MNG_OPEN              (0x17400607u)
#define KEY_MNG_OPEN_SIZE         (0x6u)
#define KEY_MNG_OPEN_RESPONSE_HDR (0xe1400307u)

#define KEY_MNG_CLOSE              (0x17410207u)
#define KEY_MNG_CLOSE_SIZE         (0x2u)
#define KEY_MNG_CLOSE_RESPONSE_HDR (0xe1410207u)

#define KEY_GEN                 (0x17420707u)
#define KEY_GEN_SIZE            (0x7u)
#define KEY_GEN_RESPONSE_HDR    (0xe1420307u)
#define KEY_GEN_UPDATE_SHIFT    (16u)
#define KEY_GEN_CREATE_SHIFT    (17u)
#define KEY_GEN_TYPE_SHIFT      (24u)
#define KEY_GEN_PERMANENT_SHIFT (16u)
#define KEY_GEN_TRANSINT_SHIFT  (17u)
#define KEY_GEN_MASTER_SHIFT    (18u)
#define KEY_GEN_KEK_SHIFT       (19u)

#define SIGN_OPEN              (0x17700607u)
#define SIGN_OPEN_SIZE         (0x6u)
#define SIGN_OPEN_RESPONSE_HDR (0xe1700307u)

#define SIGN_CLOSE              (0x17710207u)
#define SIGN_CLOSE_SIZE         (0x2u)
#define SIGN_CLOSE_RESPONSE_HDR (0xe1710207u)

#define SIGN_CMD          (0x17720807u)
#define SIGN_SIZE         (0x8u)
#define SIGN_RESPONSE_HDR (0xe1720207u)
#define SIG_SCHEME_SHIFT  (16u)
#define SIG_FLAGS_SHIFT   (24u)

#define VERIFY_OPEN              (0x17800607u)
#define VERIFY_OPEN_SIZE         (0x6u)
#define VERIFY_OPEN_RESPONSE_HDR (0xe1800307u)

#define VERIFY_CLOSE              (0x17810207u)
#define VERIFY_CLOSE_SIZE         (0x2u)
#define VERIFY_CLOSE_RESPONSE_HDR (0xe1810207u)

#define VERIFY_CMD                 (0x17820907u)
#define VERIFY_SIZE                (0x9)
#define VERIFY_RESPONSE_HDR        (0xe1820307)
#define VERIFY_RESPONSE_SUCCESS    (0x5a3cc3a5)
#define VERIFY_SIG_SIZE_SHIFT      (16u)
#define VERIFY_FLAG_INPUT_SHIFT    (8u)
#define VERIFY_FLAG_COMP_SHIFT     (9u)
#define VERIFY_FLAG_INTERNAL_SHIFT (10u)

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * brief Load ELE FW
 *
 * This function Loads firmware into EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param fw pointer in system memory where FW can be found
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_LoadFw(S3MU_Type *mu, const uint8_t *fw)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[LOAD_FW_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    /****************** Load EdgeLock FW message ***********************/
    tmsg[0] = LOAD_FW;      // LOAD_FW Command Header
    tmsg[1] = (uint32_t)fw; // EdgeLock FW address
    tmsg[2] = 0x0u;         // Reserved
    tmsg[3] = (uint32_t)fw; // EdgeLock FW address
    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, LOAD_FW_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == LOAD_FW_RESPONSE_HDR && rmsg[1] == LOAD_FW_RESPONSE_SUCCESS)
    {
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Open ELE Session
 *
 * This function opens Session for EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param sessionID pointer to output unique session ID word
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_OpenSession(S3MU_Type *mu, uint32_t *sessionID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[OPEN_SESSION_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    tmsg[0] = OPEN_SESSION; // OPEN_SESSION Command Header
    tmsg[1] = 0x02000001u;  // EdgeLock ID
    tmsg[2] = 0x00000000u;  // Operating mode | Priority
    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, OPEN_SESSION_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Check that response corresponds to the sent command */
    if (rmsg[0] == OPEN_SESSION_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        /* read Session ID data */
        *sessionID = rmsg[2];
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Close ELE Session
 *
 * This function closes the Session for EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param sessionID unique session ID obtained by calling ELE_OpenSession()
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 */
status_t ELE_CloseSession(S3MU_Type *mu, uint32_t sessionID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[CLOSE_SESSION_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    tmsg[0] = CLOSE_SESSION; // CLOSE_SESSION Command Header
    tmsg[1] = sessionID;     // Session ID

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, CLOSE_SESSION_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Check that response corresponds to the sent command */
    if (rmsg[0] == CLOSE_SESSION_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Open ELE HASH Service
 *
 * This function opens HASH Service for EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param sessionID unique session ID obtained by calling ELE_OpenSession()
 * param hashHandleID pointer to output unique HASH session handle ID word
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_OpenHashService(S3MU_Type *mu, uint32_t sessionID, uint32_t *hashHandleID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[OPEN_HASH_SESSION_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    tmsg[0] = OPEN_HASH_SESSION; // OPEN_SESSION Command Header
    tmsg[1] = sessionID;         // Session handle ID
    tmsg[2] = 0x00000000u;       // User Input address extension (UIA) - not used
    tmsg[3] = 0x00000000u;       // User Output address extension (UOA) - not used
    tmsg[4] = 0x00000000u;       // Flags (reserved)
    tmsg[5] = S3MU_ComputeMsgCrc(tmsg, OPEN_HASH_SESSION_SIZE - 1u);
    // CRC sum of all the words of the message (excluding the CRC itself)

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, OPEN_HASH_SESSION_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Check that response corresponds to the sent command */
    if (rmsg[0] == OPEN_HASH_SESSION_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        /* read Service ID data */
        *hashHandleID = rmsg[2];
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Close ELE HASH Service
 *
 * This function closes the HASH Service for EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param hashHandleID unique HASH handle ID obtained by calling ELE_OpenHashService()
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 */
status_t ELE_CloseHashService(S3MU_Type *mu, uint32_t hashHandleID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[CLOSE_HASH_SESSION_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

