JayHeng/imxrt-flexspi-mem-fw/devices/MIMXRT1189/drivers/fsl_ele_crypto.c
    tmsg[0] = CLOSE_HASH_SESSION; // CLOSE_HASH_SESSION Command Header
    tmsg[1] = hashHandleID;       // Hash handle ID

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, CLOSE_HASH_SESSION_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Check that response corresponds to the sent command */
    if (rmsg[0] == CLOSE_HASH_SESSION_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief ELE HASH
 *
 * This function computes HASH of a given message using EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param hashHandleID unique HASH handle ID obtained by calling ELE_OpenHashService()
 * param msg pointer where data to be hashed can be found
 * param out pointer to output HASH data (size is defined by used algorithm), user must ensure this memory is available
 * to ELE param size size of data in byte param alg define used hash algorithm, see hash_algo_t
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_Hash(S3MU_Type *mu, uint32_t hashHandleID, const uint8_t *msg, uint8_t *out, size_t size, hash_algo_t alg)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[HASH_ONE_GO_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];
    uint32_t outSize = 0u;

    switch (alg)
    {
        case kELE_Sha224:
            outSize = 224u / 8u;
            break;
        case kELE_Sha256:
            outSize = 256u / 8u;
            break;
        case kELE_Sha384:
            outSize = 384u / 8u;
            break;
        case kELE_Sha512:
            outSize = 512u / 8u;
            break;
        case kELE_SM3256:
            outSize = 256u / 8u;
            break;

        default:
            return kStatus_InvalidArgument;
    }

    tmsg[0] = HASH_ONE_GO;   // HASH_ONE_GO Command Header
    tmsg[1] = hashHandleID;  // Session handle ID
    tmsg[2] = (uint32_t)msg; // Input Hash address
    tmsg[3] = (uint32_t)out; // Output Hash address
    tmsg[4] = size;          // Input size
    tmsg[5] = outSize;       // Output size
    tmsg[6] = alg;           // Flag (reserved) | Alg = SHA256
    tmsg[7] = S3MU_ComputeMsgCrc(tmsg, HASH_ONE_GO_SIZE - 1u);
    // CRC sum of all the words of the message (excluding the CRC itself)

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, HASH_ONE_GO_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    if (S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT) != kStatus_Success)
    {
        return status;
    }
    /* Check that response corresponds to the sent command */
    if (rmsg[0] == HASH_ONE_GO_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Open and Create Key Store
 *
 * This function create key store and open key store services in the EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param sessionID unique session ID obtained by calling ELE_OpenSession()
 * param conf pointer where keystore configuration structure can be found
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_OpenKeystore(S3MU_Type *mu, uint32_t sessionID, ele_keystore_t *conf, uint32_t *keystoreHandleID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[OPEN_KEY_STORE_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    /* Create Flag word */

    /*   +----------------+----------+------------------------+
     *   | Min MAC length |  Flags   |      Max updates       |
     *   +----------------+----------+------------------------+
     *   | bit 31-24      | Bit 23-16|       Bit 15-0         |
     *   +----------------+----------+------------------------+
     */
    uint32_t flags = (conf->min_mac_len << MIN_MAC_LEN_SHIFT) | (conf->min_mac_check << MIN_MAC_FLAG_SHIFT) |
                     (conf->create << KEYSTORE_CREATE_SHIFT) | (conf->max_updates);

    tmsg[0] = OPEN_KEY_STORE; // OPEN_KEY_STORE Command Header
    tmsg[1] = sessionID;      // Session handle ID
    tmsg[2] = conf->id;       // Key Store ID (User defined)
    tmsg[3] = conf->nonce;    // Authentication nonce
    tmsg[4] = flags;          // MAC Min lenght (bit 31-24) | Flag (bit 23-16) | MAX update: (bit 15-0)
    tmsg[5] = S3MU_ComputeMsgCrc(tmsg, OPEN_KEY_STORE_SIZE - 1u);

    /* Send message Security Sub-System */
    if (S3MU_SendMessage(mu, tmsg, OPEN_KEY_STORE_SIZE) != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    if (S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT) != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == OPEN_KEY_STORE_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        /* read Key Store ID data */
        *keystoreHandleID = rmsg[2];
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Close Key Store
 *
 * This function closes key store and its services in the EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param keystoreHandleID unique session ID obtained by calling ELE_OpenKeystore()
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 */
status_t ELE_CloseKeystore(S3MU_Type *mu, uint32_t keystoreHandleID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[OPEN_KEY_STORE_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    tmsg[0] = CLOSE_KEY_STORE;  // CLOSE_KEY_STORE Command Header
    tmsg[1] = keystoreHandleID; // Key Store HandleID
    tmsg[2] = 0x0;              // Flags (reserved)

    /* Send message Security Sub-System */
    if (S3MU_SendMessage(mu, tmsg, CLOSE_KEY_STORE_SIZE) != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    if (S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT) != kStatus_Success)
    {
        return status;
    }

