JayHeng/imxrt-flexspi-mem-fw/devices/MIMXRT1189/drivers/fsl_ele_crypto.c
    /* Check that response corresponds to the sent command */
    if (rmsg[0] == CLOSE_KEY_STORE_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Open ELE Key Management Service
 *
 * This function opens Key Management Service for EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param keystoreHandleID unique session ID obtained by calling ELE_OpenKeystore()
 * param keyHandleID pointer where unique key management handle ID word will be stored
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_OpenKeyService(S3MU_Type *mu, uint32_t keystoreHandleID, uint32_t *keyHandleID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[KEY_MNG_OPEN_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    tmsg[0] = KEY_MNG_OPEN;     // KEY_MNG_OPEN Command Header
    tmsg[1] = keystoreHandleID; // Session handle ID
    tmsg[2] = 0x00000000u;      // User Input address extension (UIA) - not used
    tmsg[3] = 0x00000000u;      // User Output address extension (UOA) - not used
    tmsg[4] = 0x00000000u;      // Flag (reserved)
    tmsg[5] = S3MU_ComputeMsgCrc(tmsg, KEY_MNG_OPEN_SIZE - 1u);

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, KEY_MNG_OPEN_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == KEY_MNG_OPEN_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        /* read Key Management Handle ID data */
        *keyHandleID = rmsg[2];
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Close ELE Key Management Service
 *
 * This function closes the Key Management Service for EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param keyHandleID unique key management handle ID obtained by calling ELE_OpenKeyService()
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 */
status_t ELE_CloseKeyService(S3MU_Type *mu, uint32_t keyHandleID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[KEY_MNG_OPEN_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    tmsg[0] = KEY_MNG_CLOSE; // KEY_MNG_CLOSE Command Header
    tmsg[1] = keyHandleID;   // Key Management handle ID

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, KEY_MNG_CLOSE_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == KEY_MNG_CLOSE_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief ELE Generate Key
 *
 * This function generates a key inside given keys store in the EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param keyHandleID unique key management handle ID obtained by calling ELE_OpenKeyService()
 * param conf pointer where key generate configuration structure can be found
 * param keyID pointer where unique Key ID word will be stored
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_GenerateKey(S3MU_Type *mu, uint32_t keyHandleID, ele_gen_key_t *conf, uint32_t *keyID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[KEY_GEN_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    if (conf->key_group > 1023u)
    {
        return kStatus_OutOfRange;
    }

    /*   +--------------+------------+------------------------+
     *   | Key Type     |    Flags   |      Public key size   |
     *   +--------------+------------+------------------------+
     *   | bit 31-24    |   Bit 23-16|       Bit 15-0         |
     *   +--------------+------------+------------------------+
     */
    uint32_t flags_size_type = (conf->key_type << KEY_GEN_TYPE_SHIFT) | (conf->create << KEY_GEN_CREATE_SHIFT) |
                               (conf->update << KEY_GEN_UPDATE_SHIFT) | (conf->out_size);

    /*   +-------------------------+--------------------------+
     *   |        Key Info         |        Key Group         |
     *   +-------------------------+--------------------------+
     *   |        bit 31-16        |         Bit 15-0         |
     *   +-------------------------+--------------------------+
     */
    uint32_t info_group = (conf->kek << KEY_GEN_KEK_SHIFT) | (conf->master << KEY_GEN_MASTER_SHIFT) |
                          (conf->transient << KEY_GEN_TRANSINT_SHIFT) | (conf->permanent << KEY_GEN_PERMANENT_SHIFT) |
                          (conf->key_group);

    tmsg[0] = KEY_GEN;            // KEY_GEN Command Header
    tmsg[1] = keyHandleID;        // Session handle ID
    tmsg[2] = conf->key_id;       // User defined Key Identifier
    tmsg[3] = flags_size_type;    // Key Type | Flags | Out Size
    tmsg[4] = info_group;         // Key info | Key Group
    tmsg[5] = conf->out_key_addr; // Output buffer addres for public key
    tmsg[6] = S3MU_ComputeMsgCrc(tmsg, KEY_GEN_SIZE - 1u);

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, KEY_GEN_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == KEY_GEN_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        /* read Key pair ID data */
        *keyID = rmsg[2];
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Open ELE Sign Service
 *
 * This function opens Sign generation service for EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param keystoreHandleID unique session ID obtained by calling ELE_OpenKeystore()
 * param signHandleID pointer where unique sign handle ID word will be stored
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_OpenSignService(S3MU_Type *mu, uint32_t keystoreHandleID, uint32_t *signHandleID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[SIGN_OPEN_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

