JayHeng/imxrt-flexspi-mem-fw/devices/MIMXRT1189/drivers/fsl_ele_crypto.c
    tmsg[0] = SIGN_OPEN;        // SIGN_OPEN Command Header
    tmsg[1] = keystoreHandleID; // Key Store handle ID
    tmsg[2] = 0x00000000u;      // User Input address extension (UIA) - not used
    tmsg[3] = 0x00000000u;      // User Output address extension (UOA) - not used
    tmsg[4] = 0x00000000u;      // Flag (reserved)
    tmsg[5] = S3MU_ComputeMsgCrc(tmsg, SIGN_OPEN_SIZE - 1u);

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, SIGN_OPEN_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == SIGN_OPEN_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        /* read Key pair ID data */
        *signHandleID = rmsg[2];
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Close ELE Sign Service
 *
 * This function closes the Sign generation service for EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param signHandleID unique session ID obtained by calling ELE_OpenSignService()
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 */
status_t ELE_CloseSignService(S3MU_Type *mu, uint32_t signHandleID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[SIGN_CLOSE_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    tmsg[0] = SIGN_CLOSE;   // SIGN_CLOSE Command Header
    tmsg[1] = signHandleID; // Sign handle ID

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, SIGN_CLOSE_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == SIGN_CLOSE_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Open ELE Sign
 *
 * This function generates signiture based on provided data and keys using EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param signHandleID unique session ID obtained by calling ELE_OpenSignService()
 * param conf pointer where sign generate configuration structure can be found
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_Sign(S3MU_Type *mu, uint32_t signHandleID, ele_sign_t *conf)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[SIGN_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    /*   +--------------+------------+------------------------+
     *   |   Flags      | Sig Scheme |      Signature size    |
     *   +--------------+------------+------------------------+
     *   | bit 31-24    | Bit 23-16  |       Bit 15-0         |
     *   +--------------+------------+------------------------+
     */
    uint32_t flag_scheme_size =
        (conf->input_flag << SIG_FLAGS_SHIFT) | (conf->scheme << SIG_SCHEME_SHIFT) | (conf->sig_size);

    tmsg[0] = SIGN_CMD;                  // SIGN_CMD Command Header
    tmsg[1] = signHandleID;              // Sign service handle ID
    tmsg[2] = conf->key_id;              // Key ID to be used for signing
    tmsg[3] = (uint32_t)conf->msg;       // Address where the message digest to be signed can be found.
    tmsg[4] = (uint32_t)conf->signature; // Address where the signature will be written
    tmsg[5] = conf->msg_size;            // Size of message
    tmsg[6] = flag_scheme_size;          // Flag | Signatrure scheme | size of signature + 8 bit for Ry
    tmsg[7] = S3MU_ComputeMsgCrc(tmsg, SIGN_SIZE - 1u);

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, SIGN_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == SIGN_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Open ELE Verify Service
 *
 * This function opens Verify service for EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param sessionID unique session ID obtained by calling ELE_OpenSession()
 * param verifyHandleID pointer where unique verify handle ID word will be stored
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_OpenVerifyService(S3MU_Type *mu, uint32_t sessionID, uint32_t *verifyHandleID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[VERIFY_OPEN_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    tmsg[0] = VERIFY_OPEN; // VERIFY_OPEN Command Header
    tmsg[1] = sessionID;   // Key Store handle ID
    tmsg[2] = 0x00000000u; // User Input address extension (UIA) - not used
    tmsg[3] = 0x00000000u; // User Output address extension (UOA) - not used
    tmsg[4] = 0x00000000u; // Flag (reserved)
    tmsg[5] = S3MU_ComputeMsgCrc(tmsg, VERIFY_OPEN_SIZE - 1u);

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, VERIFY_OPEN_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == VERIFY_OPEN_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        /* read Key pair ID data */
        *verifyHandleID = rmsg[2];
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Close ELE Verify Service
 *
 * This function closes Verify service for EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param verifyHandleID unique session ID obtained by calling ELE_OpenVerifyService()
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 */
status_t ELE_CloseVerifyService(S3MU_Type *mu, uint32_t verifyHandleID)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[VERIFY_CLOSE_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

