JayHeng/imxrt-flexspi-mem-fw/devices/MIMXRT1189/drivers/fsl_ele_crypto.c
    tmsg[0] = VERIFY_CLOSE;   // VERIFY_OPEN Command Header
    tmsg[1] = verifyHandleID; // Verify handle ID

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, VERIFY_CLOSE_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == VERIFY_CLOSE_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}

/*!
 * brief Open ELE Verify
 *
 * This function is used to proceed with a signature verification operation using EdgeLock Enclave.
 *
 * param base MU peripheral base address
 * param verifyHandleID unique session ID obtained by calling ELE_OpenVerifyService()
 * param conf pointer where verification configuration structure can be found
 * param result true if verification success, false otherwise
 *
 * return Status kStatus_Success if success, kStatus_Fail if fail
 * Possible errors: kStatus_S3MU_InvalidArgument, kStatus_S3MU_AgumentOutOfRange
 */
status_t ELE_Verify(S3MU_Type *mu, uint32_t verifyHandleID, ele_verify_t *conf, bool *result)
{
    status_t status = kStatus_Fail;
    uint32_t tmsg[VERIFY_SIZE];
    uint32_t rmsg[S3MU_RR_COUNT];

    /*   +-------------------------+--------------------------+
     *   |     Signature size      |      Public Key size     |
     *   +-------------------------+--------------------------+
     *   |        bit 31-16        |         Bit 15-0         |
     *   +-------------------------+--------------------------+
     */
    uint32_t sig_key_size = (conf->sig_size << VERIFY_SIG_SIZE_SHIFT) | (conf->key_size);

    /*   +------------------------+------------+--------------+
     *   |      Reserved          |  Flags     | Sign  Scheme |
     *   +------------------------+------------+--------------+
     *   |       Bit 31-16        | bit 15-8   |    Bit 7-0   |
     *   +------------------------+------------+--------------+
     */
    uint32_t flags_scheme = (conf->internal << VERIFY_FLAG_INTERNAL_SHIFT) |
                            (conf->compresed << VERIFY_FLAG_COMP_SHIFT) |
                            (conf->input_flag << VERIFY_FLAG_INPUT_SHIFT) | (conf->scheme);

    tmsg[0] = VERIFY_CMD;                // VERIFY_CMD Command Header
    tmsg[1] = verifyHandleID;            // Verify service handle ID
    tmsg[2] = (uint32_t)conf->pub_key;   // Public Key address to be used
    tmsg[3] = (uint32_t)conf->msg;       // Address where the message to be verified can be found
    tmsg[4] = (uint32_t)conf->signature; // Address where the signature can be found
    tmsg[5] = sig_key_size;              // Signature size | Public key size
    tmsg[6] = conf->msg_size;            // Size of message
    tmsg[7] = flags_scheme;              // Flags | Signatrure Scheme
    tmsg[8] = S3MU_ComputeMsgCrc(tmsg, VERIFY_SIZE - 1u);

    /* Send message Security Sub-System */
    status = S3MU_SendMessage(mu, tmsg, VERIFY_SIZE);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Wait for response from Security Sub-System */
    status = S3MU_GetResponse(mu, rmsg, S3MU_RR_COUNT);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check that response corresponds to the sent command */
    if (rmsg[0] == VERIFY_RESPONSE_HDR && rmsg[1] == RESPONSE_SUCCESS)
    {
        /* If success, test result */
        if (rmsg[2] == VERIFY_RESPONSE_SUCCESS)
        {
            *result = true;
        }
        else
        {
            *result = false;
        }
        return kStatus_Success;
    }
    else
    {
        return kStatus_Fail;
    }
}
